<a href="https://colab.research.google.com/github/miller00315/estatistica_machine_learning/blob/master/Medidas_posicao_dispersao_quartis.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import math
from scipy import stats
import pandas as pd

**Quartis**

In [18]:
data_odd = [150, 151, 152, 152, 153, 154, 155, 155, 155]

datas = np.array([150, 151, 152, 152, 153, 154, 155, 155, 155, 155, 156, 156, 156,
                  157, 158, 158, 160, 160, 160, 160, 160, 161, 161, 161, 161, 162,
                  163, 163, 164, 164, 164, 165, 166, 167, 168, 168, 169, 170, 172,
                  173])

Calculo manual

In [4]:
np.median(data_odd) # mediana ou quartil 2

153.0

In [7]:
position_median = math.floor(len(data_odd) / 2)

position_median

4

In [17]:
left = data_odd[0: position_median] # seleciono os item a esquerda da mediana
left

[150, 151, 152, 152]

In [9]:
np.median(left) # encontro a media na esquerda

151.5

In [10]:
right = data_odd[position_median + 1 :] # seleciona a partir da próxima casa depois da mediana até o fim da lista
right

[154, 155, 155, 155]

In [11]:
np.median(right) # econtro a media do direita

155.0

Libraries

In [13]:
np.quantile(data_odd, 0.5) # mediana

153.0

In [14]:
np.quantile(data_odd, 0.75) # terceiro quartil

155.0

In [15]:
np.quantile(data_odd, 0.25) # primeiro quartil

152.0

In [20]:
np.quantile(datas, 0.25), np.quantile(datas, 0.5), np.quantile(datas, 0.75)

(155.75, 160.0, 164.0)

Scipy

In [22]:
stats.scoreatpercentile(datas, 25), stats.scoreatpercentile(datas, 50), stats.scoreatpercentile(datas, 75)

(155.75, 160.0, 164.0)

Pandas

In [23]:
dataset = pd.DataFrame(datas)
dataset.head()

     0
0  150
1  151
2  152
3  152
4  153

In [25]:
dataset.quantile([0.25, 0.5, 0.75])

           0
0.25  155.75
0.50  160.00
0.75  164.00

In [26]:
dataset.describe()

                0
count   40.000000
mean   160.375000
std      5.903877
min    150.000000
25%    155.750000
50%    160.000000
75%    164.000000
max    173.000000

Quartis agrupados

In [2]:

dados = {'inferior': [150, 154, 158, 162, 166, 170],
         'superior': [154, 158, 162, 166, 170, 174],
         'fi': [5, 9, 11, 7, 5, 3]}

In [3]:
dataset = pd.DataFrame(dados)
dataset

   inferior  superior  fi
0       150       154   5
1       154       158   9
2       158       162  11
3       162       166   7
4       166       170   5
5       170       174   3

In [4]:
dataset['xi'] = (dataset['superior'] + dataset['inferior']) / 2 # calculo da média aritmética
dataset

   inferior  superior  fi     xi
0       150       154   5  152.0
1       154       158   9  156.0
2       158       162  11  160.0
3       162       166   7  164.0
4       166       170   5  168.0
5       170       174   3  172.0

In [5]:
dataset['fi.xi'] = dataset['fi'] * dataset['xi'] # calculo do média pela quantidade de items da classe

dataset

   inferior  superior  fi     xi   fi.xi
0       150       154   5  152.0   760.0
1       154       158   9  156.0  1404.0
2       158       162  11  160.0  1760.0
3       162       166   7  164.0  1148.0
4       166       170   5  168.0   840.0
5       170       174   3  172.0   516.0

In [6]:
dataset['Fi'] = 0 
dataset

   inferior  superior  fi     xi   fi.xi  Fi
0       150       154   5  152.0   760.0   0
1       154       158   9  156.0  1404.0   0
2       158       162  11  160.0  1760.0   0
3       162       166   7  164.0  1148.0   0
4       166       170   5  168.0   840.0   0
5       170       174   3  172.0   516.0   0

In [7]:
accumulated_frequency = []
sommatory = 0

for row in dataset.iterrows(): # Calculo da frequencia acumulada
  sommatory += row[1][2]
  accumulated_frequency.append(sommatory)

accumulated_frequency

[5.0, 14.0, 25.0, 32.0, 37.0, 40.0]

In [8]:
dataset['Fi'] = accumulated_frequency # inserindo frequencia acumulada na tabela
dataset

   inferior  superior  fi     xi   fi.xi    Fi
0       150       154   5  152.0   760.0   5.0
1       154       158   9  156.0  1404.0  14.0
2       158       162  11  160.0  1760.0  25.0
3       162       166   7  164.0  1148.0  32.0
4       166       170   5  168.0   840.0  37.0
5       170       174   3  172.0   516.0  40.0

In [10]:
def get_quartil(dataframe, q1 = True):
  if q1 == True:
    fi_4 = dataset['fi'].sum() /4
  else:
    fi_4 = (3 * dataset['fi'].sum()) / 4
  
  bottom_limit, class_frequency, id_before_frequency = 0,0,0

  for line in dataset.iterrows():
    bottom_limit = line[1][0]
    class_frequency = line[1][2]
    id_before_frequency = line[0]

    if line[1][5] >= fi_4:
      id_before_frequency -= 1
      break
  Fi_before = dataset.iloc[[id_before_frequency]]['Fi'].values[0]

  quartil = bottom_limit +((fi_4 - Fi_before) * 4) / class_frequency

  return quartil

In [12]:
get_quartil(dados), get_quartil(dados, q1=False)

(156.22222222222223, 164.85714285714286)